tap "homebrew/bundle"
tap "homebrew/services"
tap "thezoraiz/ascii-image-converter"
# Portable ASCII art graphics library
brew "aalib"
# Run your GitHub Actions locally
brew "act"
# General-purpose data compression with high compression ratio
brew "xz"
# ANSI/ASCII art to PNG converter
brew "ansilove"
# ASCII-art image browser and animation viewer
brew "aview"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Ruby environment tool
brew "chruby"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Golang security checker
brew "gosec"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Convert JPG images to ASCII
brew "jp2a"
# Convert pixel information into colored ASCII art
brew "libcaca"
# YAML Parser
brew "libyaml"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# POSIX *nix fetch script using Nerdfonts
brew "nerdfetch"
# Image manipulation
brew "netpbm"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# State of the art linter for the Go programming language
brew "staticcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
